content-org/share/about-freetype-label.org
#+HUGO_BASE_DIR: ../..
#+TITLE: 关于freetype
#+DATE: <2019-11-20 Wednesday 12:27:30>
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_TAGS: cocos2dx freetype
#+HUGO_CATEGORIES: note
#+HUGO_SECTION: commaries
#+HUGO_DRAFT: true:
#+OPTIONS: toc:2

* 大概了解Freetype
[[https://www.freetype.org/][The FreeType Project]]
<!--more-->
这边我简单的总结下：
#+BEGIN_SRC
It is written in C, designed to be small, efficient, highly customizable, and portable while capable of producing high-quality output (glyph images) of most vector and bitmap font formats.
Some products that use FreeType for rendering fonts on screen or on paper, either exclusively or partially:
#+END_SRC
* 使用方法


* 细节记录
