content/commaries/about-freetype-label.md
+++
title = "关于freetype"
author = ["semgilo"]
date = 2019-11-20T12:27:00+08:00
lastmod = 2019-11-20T14:41:27+08:00
tags = ["cocos2dx", "freetype"]
categories = ["commary"]
draft = false
+++

<div class="ox-hugo-toc toc">
<div></div>

<div class="heading">Table of Contents</div>

- [大概了解Freetype](#大概了解freetype)
- [使用方法](#使用方法)
- [细节记录](#细节记录)

</div>
<!--endtoc-->



## 大概了解Freetype {#大概了解freetype}

[The FreeType Project](https://www.freetype.org/)
<!--more-->
这边我简单的总结下：

```nil
It is written in C, designed to be small, efficient, highly customizable, and portable while capable of producing high-quality output (glyph images) of most vector and bitmap font formats.
Some products that use FreeType for rendering fonts on screen or on paper, either exclusively or partially:
```


## 使用方法 {#使用方法}


## 细节记录 {#细节记录}
